app/Controllers/VendorController.php

    public function vendor(): string
    {
        $vendorModel = new VendorModel();
        $data['vendors'] = $vendorModel->findAll();
---
SELECT *
FROM `vendor`